app/Http/Controllers/BillController.php

    public function create($vendorId = 0)
    {

        if(\Auth::user()->can('create bill'))
        {
            $customFields = CustomField::where('created_by', '=', \Auth::user()->creatorId())->where('module', '=', 'bill')->get();
---
select * from `custom_fields` where `created_by` = 2 and `module` = 'bill'

function purchaseNumber()
    {
        $latest = Purchase::where('created_by', '=', \Auth::user()->creatorId())->latest('purchase_id')->first();
---
select * from `purchases` where `created_by` = 2 order by `purchase_id` desc limit 1

    public function store(Request $request)
{
    if (!\Auth::user()->can('create bill')) {
        return redirect()->back()->with('error', __('Permission denied.'));
    }

    // Validation
    $validator = \Validator::make($request->all(), [
        'vender_id'   => 'required',
        'bill_date'   => 'required',
        'due_date'    => 'required',
        'category_id' => 'required',
    ]);

    if ($validator->fails()) {
        return redirect()->back()->with('error', $validator->getMessageBag()->first());
    }

    // Create Bill
    $bill = new Bill();
    $bill->bill_id       = $this->billNumber();
    $bill->vender_id     = $request->vender_id;
    $bill->bill_date     = $request->bill_date;
    $bill->due_date      = $request->due_date;
    $bill->status        = 0;
    $bill->type          = 'Bill';
    $bill->user_type     = 'vendor';
    $bill->category_id   = !empty($request->category_id) ? $request->category_id : 0;
    $bill->order_number  = !empty($request->order_number) ? $request->order_number : 0;
    $bill->created_by    = \Auth::user()->creatorId();
    $bill->save();
---
insert into `bills` (`bill_id`, `vender_id`, `bill_date`, `due_date`, `status`, `type`, `user_type`, `category_id`, `order_number`, `created_by`, `updated_at`, `created_at`) values (1, '3', '2025-10-16', '2025-10-31', 0, 'Bill', 'vendor', '3', 0, 2, '2025-10-17 19:44:37', '2025-10-17 19:44:37')
insert into `bills` (`bill_id`, `vender_id`, `bill_date`, `due_date`, `status`, `type`, `user_type`, `category_id`, `order_number`, `created_by`, `updated_at`, `created_at`) values (1, '3', '2025-10-16', '2025-11-06', 0, 'Bill', 'vendor', '13', 0, 2, '2025-10-17 19:47:09', '2025-10-17 19:47:09')

            $billProduct->discount    = $product['discount'];
            $billProduct->price       = $product['price'];
            $billProduct->description = $product['description'];
            $billProduct->save();
---
insert into `bill_products` (`bill_id`, `product_id`, `quantity`, `tax`, `discount`, `price`, `description`, `updated_at`, `created_at`) values (7, '4', '5', '', '0', '234.00', '', '2025-10-17 19:47:09', '2025-10-17 19:47:09')

        $purchase->status        = 0;
        $purchase->category_id   = $request->category_id;
        $purchase->created_by    = \Auth::user()->creatorId();
        $purchase->save();
---
insert into `purchases` (`purchase_id`, `vender_id`, `warehouse_id`, `purchase_date`, `status`, `category_id`, `created_by`, `updated_at`, `created_at`) values (1, '3', '2', '2025-10-16', 0, '13', 2, '2025-10-17 19:47:09', '2025-10-17 19:47:09')

                $purchaseProduct->discount    = $product['discount'];
                $purchaseProduct->price       = $product['price'];
                $purchaseProduct->description = $product['description'];
                $purchaseProduct->save();
---
insert into `purchase_products` (`purchase_id`, `product_id`, `quantity`, `tax`, `discount`, `price`, `description`, `updated_at`, `created_at`) values (2, '4', '5', '', '0', '234.00', '', '2025-10-17 19:47:09', '2025-10-17 19:47:09')


    // Notifications
    $setting = Utility::settings(\Auth::user()->creatorId());
    $vendor  = Vender::find($request->vender_id);
---
select * from `venders` where `venders`.`id` = '3' limit 1

    public function destroy(Bill $bill)
    {
        if(\Auth::user()->can('delete bill'))
        {
            if($bill->created_by == \Auth::user()->creatorId())
            {
                $customerDebitNote = CustomerDebitNotes::where('bill',$bill->id)->first();

                if($customerDebitNote) {
                    return redirect()->back()->with('error', __('The debit note has been created for this bill, so it cannot be deleted.'));
                }

                $billpayments = $bill->payments;

                foreach($billpayments as $key => $value)
                {
                    Utility::bankAccountBalance($value->account_id, $value->amount, 'credit');
                    Utility::updateUserBalance('vendor', $bill->vender_id, $value->amount, 'debit');

                    $transaction= Transaction::where('payment_id',$value->id)->first();
                    $transaction->delete();

                    $billpayment = BillPayment::where('id', $value->id)->first();

                    AddTransactionLine::where('reference_id', $bill->id)->where('reference_sub_id', $billpayment->id)->where('reference', 'Bill Payment')->delete();

                    $billpayment->delete();
                }
                AddTransactionLine::where('reference_id',$bill->id)->where('reference','Bill')->delete();

                BillProduct::where('bill_id', '=', $bill->id)->delete();

                $debitNoteApply = DebitNote::where('bill', $bill->id)->get();
---
select * from `debit_notes` where `bill` = 3
select * from `customer_debit_notes` where `bill` = 6 limit 1
select * from `bill_payments` where `bill_payments`.`bill_id` = 6 and `bill_payments`.`bill_id` is not null
delete from `add_transaction_lines` where `reference_id` = 5 and `reference` = 'Bill'
delete from `bills` where `id` = 3
delete from `bills` where `id` = 2
delete from `add_transaction_lines` where `reference_id` = 6 and `reference` = 'Bill'
delete from `bills` where `id` = 5
delete from `bill_products` where `bill_id` = 6
select * from `debit_notes` where `bill` = 6

                    $debitNote->delete();
                }

                $bill->delete();
---
delete from `bills` where `id` = 6

    function billNumber()
    {
        $latest = Bill::where('created_by', '=', \Auth::user()->creatorId())->latest('bill_id')->first();
---
select * from `bills` where `created_by` = 2 order by `bill_id` desc limit 1

    public function product(Request $request)
    {
        $data['product']     = $product = ProductService::find($request->product_id);
---
select * from `product_services` where `product_services`.`id` = '5' limit 1

    public function vender(Request $request)
    {
        $vender = Vender::where('id', '=', $request->id)->first();
---
select * from `venders` where `id` = '3' limit 1